{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "200"}, {"size": "300"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "200"}, {"size": "300"}, {"size": "3"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "200"}, {"size": "300"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_1/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_1/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_2/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_2/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_3/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_3/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_4/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_4/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_5/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_5/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/concat_2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_6/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_6/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "200"}, {"size": "300"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/Square", "op": "Square", "input": ["input_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["input_1", "StatefulPartitionedCall/DCE-Net/separable_conv2d/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-16"}, {"size": "-17"}, {"size": "3"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/DCE-Net/sub", "op": "Sub", "input": ["StatefulPartitionedCall/DCE-Net/Square", "input_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d/separable_conv2d/depthwise", "StatefulPartitionedCall/DCE-Net/separable_conv2d/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/DCE-Net/separable_conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-16"}, {"size": "-17"}, {"size": "3"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d/Relu", "StatefulPartitionedCall/DCE-Net/separable_conv2d_1/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-12"}, {"size": "-14"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_1/separable_conv2d/depthwise", "StatefulPartitionedCall/DCE-Net/separable_conv2d_1/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/DCE-Net/separable_conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-12"}, {"size": "-14"}, {"size": "32"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_2/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_1/Relu", "StatefulPartitionedCall/DCE-Net/separable_conv2d_2/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-8"}, {"size": "-10"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_2/separable_conv2d/depthwise", "StatefulPartitionedCall/DCE-Net/separable_conv2d_2/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/DCE-Net/separable_conv2d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-8"}, {"size": "-10"}, {"size": "32"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_3/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_2/Relu", "StatefulPartitionedCall/DCE-Net/separable_conv2d_3/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-4"}, {"size": "-6"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_3/separable_conv2d/depthwise", "StatefulPartitionedCall/DCE-Net/separable_conv2d_3/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/DCE-Net/separable_conv2d_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-4"}, {"size": "-6"}, {"size": "32"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/DCE-Net/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_2/Relu", "StatefulPartitionedCall/DCE-Net/separable_conv2d_3/Relu", "StatefulPartitionedCall/DCE-Net/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_4/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/DCE-Net/concat", "StatefulPartitionedCall/DCE-Net/separable_conv2d_4/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-4"}, {"size": "-6"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_4/separable_conv2d/depthwise", "StatefulPartitionedCall/DCE-Net/separable_conv2d_4/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/DCE-Net/separable_conv2d_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-4"}, {"size": "-6"}, {"size": "64"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "32"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/DCE-Net/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_1/Relu", "StatefulPartitionedCall/DCE-Net/separable_conv2d_4/Relu", "StatefulPartitionedCall/DCE-Net/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_5/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/DCE-Net/concat_1", "StatefulPartitionedCall/DCE-Net/separable_conv2d_5/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-8"}, {"size": "-10"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_5/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_5/separable_conv2d/depthwise", "StatefulPartitionedCall/DCE-Net/separable_conv2d_5/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/DCE-Net/separable_conv2d_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-8"}, {"size": "-10"}, {"size": "64"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "32"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/DCE-Net/concat_2", "op": "ConcatV2", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d/Relu", "StatefulPartitionedCall/DCE-Net/separable_conv2d_5/Relu", "StatefulPartitionedCall/DCE-Net/concat_2/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_6/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/DCE-Net/concat_2", "StatefulPartitionedCall/DCE-Net/separable_conv2d_6/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-12"}, {"size": "-14"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_6/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_6/separable_conv2d/depthwise", "StatefulPartitionedCall/DCE-Net/separable_conv2d_6/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/DCE-Net/separable_conv2d_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-12"}, {"size": "-14"}, {"size": "64"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "3"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_6/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_6/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_6/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/mul", "op": "Mul", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_6/Tanh", "StatefulPartitionedCall/DCE-Net/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/add", "op": "AddV2", "input": ["input_1", "StatefulPartitionedCall/DCE-Net/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/Square_1", "op": "Square", "input": ["StatefulPartitionedCall/DCE-Net/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/sub_1", "op": "Sub", "input": ["StatefulPartitionedCall/DCE-Net/Square_1", "StatefulPartitionedCall/DCE-Net/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_6/Tanh", "StatefulPartitionedCall/DCE-Net/sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/DCE-Net/add", "StatefulPartitionedCall/DCE-Net/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/Square_2", "op": "Square", "input": ["StatefulPartitionedCall/DCE-Net/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/sub_2", "op": "Sub", "input": ["StatefulPartitionedCall/DCE-Net/Square_2", "StatefulPartitionedCall/DCE-Net/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_6/Tanh", "StatefulPartitionedCall/DCE-Net/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/DCE-Net/add_1", "StatefulPartitionedCall/DCE-Net/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/Square_3", "op": "Square", "input": ["StatefulPartitionedCall/DCE-Net/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/sub_3", "op": "Sub", "input": ["StatefulPartitionedCall/DCE-Net/Square_3", "StatefulPartitionedCall/DCE-Net/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/mul_3", "op": "Mul", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_6/Tanh", "StatefulPartitionedCall/DCE-Net/sub_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/DCE-Net/add_2", "StatefulPartitionedCall/DCE-Net/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/Square_4", "op": "Square", "input": ["StatefulPartitionedCall/DCE-Net/add_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/sub_4", "op": "Sub", "input": ["StatefulPartitionedCall/DCE-Net/Square_4", "StatefulPartitionedCall/DCE-Net/add_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/mul_4", "op": "Mul", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_6/Tanh", "StatefulPartitionedCall/DCE-Net/sub_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/add_4", "op": "AddV2", "input": ["StatefulPartitionedCall/DCE-Net/add_3", "StatefulPartitionedCall/DCE-Net/mul_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/Square_5", "op": "Square", "input": ["StatefulPartitionedCall/DCE-Net/add_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/sub_5", "op": "Sub", "input": ["StatefulPartitionedCall/DCE-Net/Square_5", "StatefulPartitionedCall/DCE-Net/add_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/mul_5", "op": "Mul", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_6/Tanh", "StatefulPartitionedCall/DCE-Net/sub_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/add_5", "op": "AddV2", "input": ["StatefulPartitionedCall/DCE-Net/add_4", "StatefulPartitionedCall/DCE-Net/mul_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/Square_6", "op": "Square", "input": ["StatefulPartitionedCall/DCE-Net/add_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/sub_6", "op": "Sub", "input": ["StatefulPartitionedCall/DCE-Net/Square_6", "StatefulPartitionedCall/DCE-Net/add_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/mul_6", "op": "Mul", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_6/Tanh", "StatefulPartitionedCall/DCE-Net/sub_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/add_6", "op": "AddV2", "input": ["StatefulPartitionedCall/DCE-Net/add_5", "StatefulPartitionedCall/DCE-Net/mul_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/Square_7", "op": "Square", "input": ["StatefulPartitionedCall/DCE-Net/add_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/sub_7", "op": "Sub", "input": ["StatefulPartitionedCall/DCE-Net/Square_7", "StatefulPartitionedCall/DCE-Net/add_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/mul_7", "op": "Mul", "input": ["StatefulPartitionedCall/DCE-Net/separable_conv2d_6/Tanh", "StatefulPartitionedCall/DCE-Net/sub_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DCE-Net/add_7", "op": "AddV2", "input": ["StatefulPartitionedCall/DCE-Net/add_6", "StatefulPartitionedCall/DCE-Net/mul_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/DCE-Net/add_7"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d/separable_conv2d/ReadVariableOp", "shape": [3, 3, 3, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d/separable_conv2d/ReadVariableOp_1", "shape": [1, 1, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_1/separable_conv2d/ReadVariableOp", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_1/separable_conv2d/ReadVariableOp_1", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_2/separable_conv2d/ReadVariableOp", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_2/separable_conv2d/ReadVariableOp_1", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_2/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_3/separable_conv2d/ReadVariableOp", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_3/separable_conv2d/ReadVariableOp_1", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_3/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_4/separable_conv2d/ReadVariableOp", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_4/separable_conv2d/ReadVariableOp_1", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_4/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_5/separable_conv2d/ReadVariableOp", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_5/separable_conv2d/ReadVariableOp_1", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_5/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/concat_2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_6/separable_conv2d/ReadVariableOp", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_6/separable_conv2d/ReadVariableOp_1", "shape": [1, 1, 64, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/DCE-Net/separable_conv2d_6/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}]}]}